Revit 2024 API
Entity Properties
The Entity type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Schema
 The Schema describing this Entity.
SchemaGUID
 The GUID of the Schema describing this Entity.
See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace